# Project: Building MySQL Database for VHS Rental Store | Cristiane Carneiro

## Data Cleaning : actors.csv

In this file, one can review the step by step cleaning process for table actors.csv

### Import

We start by importing the libraries we are going to use and loading the database

In [96]:
%pip install ipython
%pip install seaborn

Requirement already satisfied: ipython in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (8.16.1)
Requirement already satisfied: backcall in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (0.2.0)
Requirement already satisfied: decorator in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (5.1.1)
Requirement already satisfied: jedi>=0.16 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (0.19.1)
Requirement already satisfied: matplotlib-inline in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (0.1.6)
Requirement already satisfied: pickleshare in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (0.7.5)
Requirement already satisfied: prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (3.0.39)
Requirement already satisfied: pygments>=2.4.0 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (2.16.1)
Requirement already satisfied: stack-data in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (0.6.3)
Requirement already satisfied: traitlets>=5 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (5.11.2)
Requirement already satisfied: exceptiongroup in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (1.1.3)
Requirement already satisfied: pexpect>4.3 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (4.8.0)
Requirement already satisfied: appnope in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (0.1.3)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from jedi>=0.16->ipython) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from pexpect>4.3->ipython) (0.7.0)
Requirement already satisfied: wcwidth in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30->ipython) (0.2.8)
Requirement already satisfied: executing>=1.2.0 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from stack-data->ipython) (2.0.0)
Requirement already satisfied: asttokens>=2.1.0 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from stack-data->ipython) (2.4.0)
Requirement already satisfied: pure-eval in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from stack-data->ipython) (0.2.2)
Requirement already satisfied: six>=1.12.0 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from asttokens>=2.1.0->stack-data->ipython) (1.16.0)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: seaborn in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (0.13.0)
Requirement already satisfied: numpy!=1.24.0,>=1.20 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from seaborn) (1.26.1)
Requirement already satisfied: pandas>=1.2 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from seaborn) (2.1.1)
Requirement already satisfied: matplotlib!=3.6.1,>=3.3 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from seaborn) (3.8.0)
Requirement already satisfied: contourpy>=1.0.1 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.3->seaborn) (1.1.1)
Requirement already satisfied: cycler>=0.10 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.3->seaborn) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.3->seaborn) (4.43.1)
Requirement already satisfied: kiwisolver>=1.0.1 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.3->seaborn) (1.4.5)
Requirement already satisfied: packaging>=20.0 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.3->seaborn) (23.2)
Requirement already satisfied: pillow>=6.2.0 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.3->seaborn) (10.1.0)
Requirement already satisfied: pyparsing>=2.3.1 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.3->seaborn) (3.1.1)
Requirement already satisfied: python-dateutil>=2.7 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.3->seaborn) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from pandas>=1.2->seaborn) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from pandas>=1.2->seaborn) (2023.3)
Requirement already satisfied: six>=1.5 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.3->seaborn) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [97]:
import pandas as pd
pd.set_option('display.max_columns', None)

import numpy as np

import warnings
warnings.filterwarnings('ignore')

import pylab as plt  

import seaborn as sns 

%matplotlib inline

In [98]:
actors = pd.read_csv('/Users/criscarneiro/desktop/ironhack/6_Projects/sql-data-base-building/data/raw/actor.csv')

In [99]:
actors.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

### Good practices

Some good practices before we continue with the exercise

In [100]:
#creating a back-up with the original table 

actorsoriginal = actors.copy()

In [101]:
#ensuring column names are clean 

actors.columns

Index(['actor_id', 'first_name', 'last_name', 'last_update'], dtype='object')

In [102]:
actors.columns = [c.lower().replace(' ', '_') for c in actors.columns]

actors.columns

Index(['actor_id', 'first_name', 'last_name', 'last_update'], dtype='object')

In [103]:
#checking for duplicates 

actors.duplicated().any() #there are no duplicates

False

### Explore

Exploratory analysis to understand the data base (e.g,. description, column types, searching for null values)

In [104]:
#it seems we have a repository of actors with their respective IDs and the data in each it was updated. 

actors.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [105]:
#we have 4 columns, and 200 entries (rows) in our original database

actorsoriginal.shape

(200, 4)

In [106]:
#here we can see the type of each of the columns - int type for column ID, and object type for the name columns (strings)
#it seems all values are non-null

actors.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 6.4+ KB

In [107]:
#description table 
#here we can see the #of unique values, and the mode of each field. Ultimately we will be interested on the unique 'full names', so worth checking if there are non-unique values there

actors.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
actor_id,200.0,NaN,NaN,NaN,100.5,57.879185,1.0,50.75,100.5,150.25,200.0
first_name,200,128,PENELOPE,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN
last_name,200,121,KILMER,5,NaN,NaN,NaN,NaN,NaN,NaN,NaN
last_update,200,1,2006-02-15 04:34:33,200,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Null values

As stated above, there are no null values in the database. See per below:

In [108]:
#there are no null values in the database 

nan_cols = actors.isna().sum()

nan_cols

actor_id       0
first_name     0
last_name      0
last_update    0
dtype: int64

### Other cleaning

#### actor_id

In [109]:
#we got a list of int values, which seem to be IDs for the each actor
#this is the most appropriate datatype 

actors.actor_id.dtype

dtype('int64')

In [110]:
#it seems all the IDs are unique values 

len(actors.actor_id.unique())

200

In [111]:
#actors.actor_id.unique()

#### last_update

In [112]:
#this column is type 'object'. It seems tough it would be most appropriate as a 'time type'

actors.last_update.dtype

dtype('O')

In [113]:
#all the values are the same, indicating all the names were last updated on Feb 15th 2006

actors.last_update.value_counts()

last_update
2006-02-15 04:34:33    200
Name: count, dtype: int64

In [114]:
#I will convert the data to datetime64

actors.last_update = pd.to_datetime(actors.last_update)

In [115]:
#converted 

actors.last_update.dtype

dtype('<M8[ns]')

#### first_name, last_name, and new column full_name

I will clean the columns first_name, last_name together, and make sure there are no repeated actors (by their full name)

In [116]:
#this column is type 'object'. They cointain a list of strings 

print(actors.first_name.dtype)
print(actors.last_name.dtype)

object
object

In [117]:
#these are the top first_names 
#some repeated values, but let us wait until we see full names

actors.first_name.value_counts().head(3)

first_name
PENELOPE    4
JULIA       4
KENNETH     4
Name: count, dtype: int64

In [118]:
#actors.first_name.unique()

In [119]:
#these are the top last_names 
#some repeated values, but let us wait until we see full names

actors.last_name.value_counts().head(3)

last_name
KILMER    5
TEMPLE    4
NOLTE     4
Name: count, dtype: int64

In [120]:
#actors.last_name.unique()

In [121]:
#I personally don't like uppercase

In [122]:
actors.first_name = actors.first_name.apply(lambda X: X.title().replace(' ',''))

In [123]:
actors.last_name = actors.last_name.apply(lambda X: X.title().replace(' ',''))

In [124]:
actors.head()

   actor_id first_name     last_name         last_update
0         1   Penelope       Guiness 2006-02-15 04:34:33
1         2       Nick      Wahlberg 2006-02-15 04:34:33
2         3         Ed         Chase 2006-02-15 04:34:33
3         4   Jennifer         Davis 2006-02-15 04:34:33
4         5     Johnny  Lollobrigida 2006-02-15 04:34:33

In [125]:
#let us create a full name column, and place it after last_name 

actors.insert(3, 'full_name', actors['first_name'] + ' ' + actors['last_name'])

In [126]:
#now let us see if we have repeated actors 

actors.full_name.value_counts()

full_name
Susan Davis             2
Ewan Gooding            1
Daryl Crawford          1
Greta Keitel            1
Jane Jackman            1
                       ..
Michelle Mcconaughey    1
Adam Grant              1
Sean Williams           1
Gary Penn               1
Thora Temple            1
Name: count, Length: 199, dtype: int64

In [127]:
#actors.full_name.unique()

In [128]:
#it seems we do have a repeated value. However, there are indeed more than one actress named Susan Davis. 
#for now I will keep both values, but keep that info in mind as we establish links between the tables

'''From chat GPT 
Susan Davis (born 1943): Known for her roles in films such as "Three Women" (1977) and "Love and Death" (1975).

Susan Davis (born 1944): Known for her role as Betty Munson in the TV series "The Mary Tyler Moore Show" (1970-1977) and its spin-off "Lou Grant" (1977-1982).'''

'From chat GPT \nSusan Davis (born 1943): Known for her roles in films such as "Three Women" (1977) and "Love and Death" (1975).\n\nSusan Davis (born 1944): Known for her role as Betty Munson in the TV series "The Mary Tyler Moore Show" (1970-1977) and its spin-off "Lou Grant" (1977-1982).'

### Column types and optimization

I will optimize the database for memory

In [129]:
actors.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   full_name    200 non-null    object
 4   last_update  200 non-null    datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 41.3 KB

In [130]:
#downcast actor_id

actors.actor_id = pd.to_numeric(actors.actor_id, downcast='integer')

In [131]:
#name columns to 'category'

for c in actors.select_dtypes(include='object'):
    
    actors[c] = actors[c].astype('category')

In [132]:
#no need for 'nanoseconds' precision

actors.last_update = actors.last_update.astype('datetime64[s]')

### Comparison output vs. original

In [133]:
#one additional column as we have created a 'full_name' column 

print(actorsoriginal.shape)
print(actors.shape)

(200, 4)
(200, 5)

In [134]:
actors.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int16
 1   first_name   200 non-null    category
 2   last_name    200 non-null    category
 3   full_name    200 non-null    category
 4   last_update  200 non-null    datetime64[s]
dtypes: category(3), datetime64[s](1), int16(1)
memory usage: 48.1 KB

In [135]:
actorsoriginal.info(memory_usage='deep') #take into account we have included a column

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 41.0 KB

### Export clean table

In [136]:
actors.to_csv('/Users/criscarneiro/desktop/ironhack/6_Projects/sql-data-base-building/data/clean/actor_clean.csv', index=False)